app/controllers/bicycles_controller.rb

SELECT `bicycles`.* FROM `bicycles`
---
  def index
    @bicycles = Bicycle.all

INSERT INTO `bicycles` (`chainring`, `cog`, `created_at`, `name`, `rim`, `tire`, `updated_at`) VALUES (55, 32, '2014-05-13 08:35:32', 'RAPTOR 143', 26, 1, '2014-05-13 08:35:32')
---
  def create
    @bicycle = Bicycle.create(params[:bicycle])

SELECT `bicycles`.* FROM `bicycles` WHERE `bicycles`.`id` = 1 LIMIT 1
---
  def find_bicycle
    @bicycle = Bicycle.find(params[:id])